note/drawio/converted/dot/260527-sv-rv32i-multi.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_B41RF5fDZg85oseUpRRu_1" [label="FETCH"];
  "n_zxzzcLYM27ozNX4tYacm_1" [label="DECODE"];
  "n_zxzzcLYM27ozNX4tYacm_11" [label="Store or ImmediateLoad"];
  "n_zxzzcLYM27ozNX4tYacm_16" [label="Store"];
  "n_zxzzcLYM27ozNX4tYacm_17" [label="ImmediateLoad"];
  "n_zxzzcLYM27ozNX4tYacm_18" [label="ANY_TYPE\nOPCODE"];
  "n_zxzzcLYM27ozNX4tYacm_2" [label="EXECUTE"];
  "n_zxzzcLYM27ozNX4tYacm_22" [label="!(Store or ImmediateLoad)"];
  "n_zxzzcLYM27ozNX4tYacm_3" [label="MEMORY"];
  "n_zxzzcLYM27ozNX4tYacm_4" [label="WRITE\nBACK"];
  "n_B41RF5fDZg85oseUpRRu_1" -> "n_zxzzcLYM27ozNX4tYacm_1";
  "n_zxzzcLYM27ozNX4tYacm_1" -> "n_zxzzcLYM27ozNX4tYacm_2";
  "n_zxzzcLYM27ozNX4tYacm_2" -> "n_zxzzcLYM27ozNX4tYacm_3";
  "n_zxzzcLYM27ozNX4tYacm_2" -> "n_B41RF5fDZg85oseUpRRu_1";
  "n_zxzzcLYM27ozNX4tYacm_3" -> "n_zxzzcLYM27ozNX4tYacm_4";
  "n_zxzzcLYM27ozNX4tYacm_3" -> "n_B41RF5fDZg85oseUpRRu_1";
  "n_zxzzcLYM27ozNX4tYacm_4" -> "n_B41RF5fDZg85oseUpRRu_1";
  "n_zxzzcLYM27ozNX4tYacm_18" -> "n_B41RF5fDZg85oseUpRRu_1";
}
